-- subquery 
-- 1 평균급여보다 적은 급여를 받는 직원은 몇명 

-- 2 평균 급여 이상 최대급여 이하의 월급을 받는 사원의 
-- 직원번호, 이름, 급여, 평균급여, 최대급여를 급여의 오름차순으로 정렬 출력 
    
-- 3 직원중 Steven king 이 소속된 부서가 있는 주소 확인 
-- > 도시아이디, 거리명, 우편번호, 도시명, 주소, 나라아이디 출력 

-- 4 job id가 st_man인 직원의 급여보다 작은 직원의
-- 사번, 이름, 급여를 급여의 내림차순으로 출력 
    
    
    
    
    
-- 5  각 부서별로 최고의 급여를 받는 사원의 직원번호, 이름과 급여, 부서번호를 조회 
-- 급여의 내림차순으로 정렬 
-- 조건절 비교, 테이블 조인 2가지 방법으로 작성 


-- 6 각 업무(job)별로 연봉의 총합 구하기 
-- 연봉총합이 가장 높은 업무순(title)으로 조회 





-- 7 자신의 부서 평균 급여보다 연봉이 많은 직원의 직원번호, 이름과 급여 조회 




-- 8 직원 입사일이 11번째에서 15번째의 직원의 사번, 이름, 급여, 입사일을 입사일 순서로 출력 
    